anthropic.claude-code
bradlc.vscode-tailwindcss
dbaeumer.vscode-eslint
eamodio.gitlens
esbenp.prettier-vscode
formulahendry.auto-close-tag
golang.go
mikestead.dotenv
pkief.material-icon-theme
tamasfe.even-better-toml
tobias-z.vscode-harpoon
vscodevim.vim
wayou.vscode-todo-highlight
zhuangtongfa.material-theme
