anthropic.claude-code
bierner.markdown-mermaid
bpruitt-goddard.mermaid-markdown-syntax-highlighting
bradlc.vscode-tailwindcss
catppuccin.catppuccin-vsc
davidanson.vscode-markdownlint
dbaeumer.vscode-eslint
eamodio.gitlens
editorconfig.editorconfig
esbenp.prettier-vscode
formulahendry.auto-close-tag
golang.go
gruntfuggly.todo-tree
humao.rest-client
mikestead.dotenv
oven.bun-vscode
pkief.material-icon-theme
rust-lang.rust-analyzer
streetsidesoftware.code-spell-checker
tamasfe.even-better-toml
tauri-apps.tauri-vscode
tobias-z.vscode-harpoon
vscodevim.vim
vue.volar
wayou.vscode-todo-highlight
zhuangtongfa.material-theme
