asvetliakov.vscode-neovim
bradlc.vscode-tailwindcss
burkeholland.simple-react-snippets
dbaeumer.vscode-eslint
denoland.vscode-deno
eamodio.gitlens
esbenp.prettier-vscode
formulahendry.auto-close-tag
formulahendry.auto-rename-tag
golang.go
mikestead.dotenv
pkief.material-icon-theme
sqrtt.prophet
streetsidesoftware.code-spell-checker
tamasfe.even-better-toml
tobias-z.vscode-harpoon
vscodevim.vim
wayou.vscode-todo-highlight
yoavbls.pretty-ts-errors
zhuangtongfa.material-theme
